*** Code to emit info-dir-files

#+begin_src emacs-lisp :tangle no :results value wrap  
  (apply 'concat 
         "#+name: info-dir-autogenerated\n"
         "#+begin_src texinfo :tangle no\n" 
         "  This listing was autogenerated on: " (current-time-string) "\n"
         "  -----------------------------------------------------------\n\n"
         (append (mapcar '(lambda (f) 
                            (cond ((string= f "dir")
                                   "")
                                  ((string= (substring f 0 1) ".")
                                   "")
                                  (t
                                   (concat "  * " f "(" f ")          Docco!\n") )))
                         (directory-files (expand-file-name "dist/info" emagician-dir)))
                 '("#+end_src" "\n")))
#+end_src

#+RESULTS:
:RESULTS:
#+name: info-dir-autogenerated
#+begin_src texinfo :tangle no
  This listing was autogenerated on: Thu Oct 11 00:27:30 2012
  -----------------------------------------------------------

  * git.info(git.info)          Docco!
  * gitman.info(gitman.info)          Docco!
  * r5rs.info(r5rs.info)          Docco!
#+end_src
:END:


